In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import re
from geopy.geocoders import ArcGIS
from sklearn.model_selection import StratifiedKFold
from sklearn.model_selection import train_test_split
from category_encoders import LeaveOneOutEncoder
from category_encoders.wrapper import NestedCVWrapper

%matplotlib inline

**warning**: este notebook usa un servicio de geocoding y tarda **mucho** en correr. Para facilitar las cosas guardo los datos obtenidos en `geo.cvs` y hago el análisis en un notebook separado (`analyze_location.ipynb`).

In [2]:
train_dataset = pd.read_csv('../dataset/train.csv', index_col=0)
test_dataset = pd.read_csv('../dataset/test.csv', index_col=0)
data = pd.concat([test_dataset, train_dataset])
data = data.drop(columns=['text', 'keyword'])
data = data[data['location'].notnull()]
data['location'] = data['location'].map(lambda x: x.lower())
data.sort_index(inplace=True)
data

                             location  target
id
46                             london     NaN
47     niall's place | saf 12 squad |     NaN
48                         birmingham     1.0
49      est. september 2012 - bristol     0.0
50                             africa     1.0
...                               ...     ...
10826                              tn     0.0
10829          #newcastleupontyne #uk     0.0
10831               vancouver, canada     0.0
10832                         london      0.0
10833                         lincoln     0.0

[7238 rows x 2 columns]

### Coordenadas
Se puede ver que algunas ubicaciones son coordenadas. Trato de idenificarlas y buscar sus datos

In [3]:
def to_coord(loc):
    try:
        x, y = loc.split(',')
        x = float(re.findall(r'-?[\d\.]+', x)[0])
        if not (-90 < x < 90): return np.nan
        y = float(re.findall(r'-?[\d\.]+', y)[0])
        if not (-180 < y <180): return np.nan
        return x, y
    except:
        return np.nan

coords = data['location'].map(to_coord).dropna()
coords

id
196                       (19.600858, -99.047821)
1350                      (30.307558, -81.403118)
1433                      (39.982988, -75.261624)
1794                      (41.373061, -71.942237)
1973                     (-27.499212, 153.011072)
2460                      (-6.152261, 106.775995)
2499                      (41.252426, -96.072013)
2568                     (21.462446, -158.022017)
2616                       (52.479722, 62.184971)
2984                      (-26.695807, 27.837865)
3101     (10.614817868480726, 12.195582811791382)
3114                        (46.950109, 7.439469)
3256                                   (0.0, 0.0)
3389                      (36.142163, -95.979189)
3402                      (40.736324, -73.990062)
3569                      (33.209923, -87.545328)
3725                            (6.4682, 3.18287)
3787                       (19.123127, 72.825133)
4065                        (48.870833, 2.399227)
4847                       (43.631838, -79.55807)
4849                         (44.41451, 8.942499)
4928                     (39.168519, -119.766123)
5115     (10.614817868480726, 12.195582811791382)
5706                     (21.462446, -158.022017)
6315                      (40.562796, -75.488849)
6561                      (35.223347, -80.827834)
7181                       (58.193556, -5.334943)
7573       (6.488400524109015, 3.352798039832285)
7813                      (40.707762, -74.014213)
7845                      (41.106046, -80.657836)
8034                     (21.462446, -158.022017)
8145                     (50.953278, -113.978785)
8174                        (7.384559, 3.8793718)
8685                      (42.910975, -78.865828)
9081                    (27.9136024, -81.6078532)
9161                      (19.600858, -99.047821)
9662                      (35.353272, -78.553744)
9863                       (53.337853, -6.288693)
10192                       (1.50225, 103.742992)
10538                     (28.709672, -97.376514)
10658                     (33.104393, -96.628624)
Name: location, dtype: object

In [4]:
geocoder = ArcGIS(
    timeout=500,
    user_agent='tp1_datos_1c2020',
    username='tp1_datos_1c2020',
    password='datos_1c2020',
    referer='www.datos_1c2020.com'
)

In [5]:
def geo_info_by_coords(lat, lon, geocoder):
    response = geocoder.reverse(query=f'{lat},{lon}')
    return {
            'lat': lat,
            'lon': lon,
            'country': response.raw['CountryCode'],
            'city': response.raw.get('City', np.nan),
            'match_score': 100,
        }

In [6]:
coords_info = pd.DataFrame(list(coords.map(lambda x: geo_info_by_coords(x[0], x[1], geocoder))), index=coords.index)
coords_info

             lat         lon country                 city  match_score
id
196    19.600858  -99.047821     MEX  Ecatepec de Morelos          100
1350   30.307558  -81.403118     USA        Neptune Beach          100
1433   39.982988  -75.261624     USA         Philadelphia          100
1794   41.373061  -71.942237     USA           Stonington          100
1973  -27.499212  153.011072     AUS             Brisbane          100
2460   -6.152261  106.775995     IDN    Grogol Petamburan          100
2499   41.252426  -96.072013     USA                Omaha          100
2568   21.462446 -158.022017     USA             Mililani          100
2616   52.479722   62.184971     KAZ       Денисов ауданы          100
2984  -26.695807   27.837865     ZAF             Emfuleni          100
3101   10.614818   12.195583     NGA                  Biu          100
3114   46.950109    7.439469     CHE                 Bern          100
3256    0.000000    0.000000                                       100
3389   36.142163  -95.979189     USA                Tulsa          100
3402   40.736324  -73.990062     USA             New York          100
3569   33.209923  -87.545328     USA           Tuscaloosa          100
3725    6.468200    3.182870     NGA                  Ojo          100
3787   19.123127   72.825133     IND               Mumbai          100
4065   48.870833    2.399227     FRA                Paris          100
4847   43.631838  -79.558070     CAN              Toronto          100
4849   44.414510    8.942499     ITA               Genova          100
4928   39.168519 -119.766123     USA          Carson City          100
5115   10.614818   12.195583     NGA                  Biu          100
5706   21.462446 -158.022017     USA             Mililani          100
6315   40.562796  -75.488849     USA            Allentown          100
6561   35.223347  -80.827834     USA            Charlotte          100
7181   58.193556   -5.334943     GBR                Lairg          100
7573    6.488401    3.352798     NGA             Surulere          100
7813   40.707762  -74.014213     USA             New York          100
7845   41.106046  -80.657836     USA           Youngstown          100
8034   21.462446 -158.022017     USA             Mililani          100
8145   50.953278 -113.978785     CAN              Calgary          100
8174    7.384559    3.879372     NGA    Ibadan North West          100
8685   42.910975  -78.865828     USA              Buffalo          100
9081   27.913602  -81.607853     USA           Lake Wales          100
9161   19.600858  -99.047821     MEX  Ecatepec de Morelos          100
9662   35.353272  -78.553744     USA                 Dunn          100
9863   53.337853   -6.288693     IRL               Dublin          100
10192   1.502250  103.742992     MYS          Johor Bahru          100
10538  28.709672  -97.376514     USA               Goliad          100
10658  33.104393  -96.628624     USA                Allen          100

### Dirección
El resto de las ubicaciones se buscan como string

In [7]:
data['coords'] = coords
names = data[data['coords'].isnull()]['location']
names

id
46                               london
47       niall's place | saf 12 squad |
48                           birmingham
49        est. september 2012 - bristol
50                               africa
                      ...
10826                                tn
10829            #newcastleupontyne #uk
10831                 vancouver, canada
10832                           london
10833                           lincoln
Name: location, Length: 7197, dtype: object

In [8]:
def geo_info_by_string(query, geocoder):
    response = geocoder.geocode(query=query, out_fields=['Country', 'Score', 'City'])
    try:
        return {
            'lat': response.point.latitude,
            'lon': response.point.longitude,
            'country': response.raw['attributes'].get('Country', np.nan),
            'city': response.raw['attributes'].get('City', np.nan),
            'match_score': response.raw['attributes'].get('Score', np.nan),
        }
    except (KeyError, AttributeError):
        return {
            'lat': np.nan,
            'lon': np.nan,
            'country': np.nan,
            'city': np.nan,
            'match_score': 0,
        }

In [9]:
names_info = pd.DataFrame(list(names.map(lambda x: geo_info_by_string(x, geocoder))), index=names.index)
names_info

             lat         lon country        city  match_score
id
46     51.506420   -0.127210     GBR      London       100.00
47     19.633330  -72.516670     HTI       Place        68.60
48     52.478910   -1.905920     GBR  Birmingham       100.00
49     51.453790   -2.591680     GBR     Bristol        73.00
50      7.188100   21.093750                           100.00
...          ...         ...     ...         ...          ...
10826  34.116318    9.608516     TUN                   100.00
10829  54.973280   -1.613960     GBR     نیوکاسل        99.98
10831  49.260380 -123.113360     CAN   Vancouver       100.00
10832  51.506420   -0.127210     GBR      London       100.00
10833  40.813620  -96.707300     USA     Lincoln       100.00

[7197 rows x 5 columns]

In [10]:
all = pd.concat([names_info, coords_info, train_dataset[train_dataset['location'].isnull()], test_dataset[test_dataset['location'].isnull()]])[['country', 'city', 'match_score', 'location']]
all['has_location'] = all['location'].notnull().apply(lambda x: 1 if x else 0)
all = all.drop(columns=['location'])
all = all.merge(train_dataset['target'], how="outer", left_index=True, right_index=True)
all

      country city  match_score  has_location  target
id
0         NaN  NaN          NaN             0     NaN
1         NaN  NaN          NaN             0     1.0
2         NaN  NaN          NaN             0     NaN
3         NaN  NaN          NaN             0     NaN
4         NaN  NaN          NaN             0     1.0
...       ...  ...          ...           ...     ...
10871     NaN  NaN          NaN             0     1.0
10872     NaN  NaN          NaN             0     1.0
10873     NaN  NaN          NaN             0     1.0
10874     NaN  NaN          NaN             0     NaN
10875     NaN  NaN          NaN             0     NaN

[10876 rows x 5 columns]

In [11]:
all.describe()

       match_score  has_location      target
count  7238.000000       10876.0  7613.00000
mean     93.003531           0.0     0.42966
std      17.108331           0.0     0.49506
min       0.000000           0.0     0.00000
25%      96.502500           0.0     0.00000
50%     100.000000           0.0     0.00000
75%     100.000000           0.0     1.00000
max     100.000000           0.0     1.00000

In [12]:
train = all[all['target'].notnull()]
train

      country city  match_score  has_location  target
id
1         NaN  NaN          NaN             0     1.0
4         NaN  NaN          NaN             0     1.0
5         NaN  NaN          NaN             0     1.0
6         NaN  NaN          NaN             0     1.0
7         NaN  NaN          NaN             0     1.0
...       ...  ...          ...           ...     ...
10869     NaN  NaN          NaN             0     1.0
10870     NaN  NaN          NaN             0     1.0
10871     NaN  NaN          NaN             0     1.0
10872     NaN  NaN          NaN             0     1.0
10873     NaN  NaN          NaN             0     1.0

[7613 rows x 5 columns]

In [13]:
test = all[all['target'].isnull()]
test

      country city  match_score  has_location  target
id
0         NaN  NaN          NaN             0     NaN
2         NaN  NaN          NaN             0     NaN
3         NaN  NaN          NaN             0     NaN
9         NaN  NaN          NaN             0     NaN
11        NaN  NaN          NaN             0     NaN
...       ...  ...          ...           ...     ...
10861     NaN  NaN          NaN             0     NaN
10865     NaN  NaN          NaN             0     NaN
10868     NaN  NaN          NaN             0     NaN
10874     NaN  NaN          NaN             0     NaN
10875     NaN  NaN          NaN             0     NaN

[3263 rows x 5 columns]

In [14]:
enc_nested = NestedCVWrapper(LeaveOneOutEncoder(cols=['country', 'city']), random_state=42)

X_train_enc, X_test_enc = enc_nested.fit_transform(train[['country', 'city']].fillna("no_info"), train['target'], X_test=test[['country', 'city']].fillna("no_info"))
X_train_enc = X_train_enc.set_index(train_dataset.index)

/home/fransic/Personal/Facultad/1c2020/datos/tps/datos-tp2/venv/lib/python3.8/site-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):
/home/fransic/Personal/Facultad/1c2020/datos/tps/datos-tp2/venv/lib/python3.8/site-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):
/home/fransic/Personal/Facultad/1c2020/datos/tps/datos-tp2/venv/lib/python3.8/site-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):
/home/fransic/Personal/Facultad/1c2020/datos/tps/datos-tp2/venv/lib/python3.8/site-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):
/home/fransic/Personal/Facultad/1c2020/datos/tps/datos-tp2/venv/lib/python3.8/site-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):
/home/fransic/Personal/Facultad/1c2020/datos/tps/datos-tp2/venv/lib/python3.8/site-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

In [15]:
X_train_enc

        country      city
id
1      0.422934  0.422934
4      0.420188  0.420188
5      0.420188  0.420188
6      0.420188  0.420188
7      0.414843  0.414843
...         ...       ...
10869  0.414843  0.414843
10870  0.414843  0.414843
10871  0.414843  0.414843
10872  0.414843  0.414843
10873  0.424917  0.424917

[7613 rows x 2 columns]

In [16]:
X_test_enc

        country      city
id
0      0.421769  0.421769
2      0.421769  0.421769
3      0.421769  0.421769
9      0.421769  0.421769
11     0.421769  0.421769
...         ...       ...
10861  0.421769  0.421769
10865  0.421769  0.421769
10868  0.421769  0.421769
10874  0.421769  0.421769
10875  0.421769  0.421769

[3263 rows x 2 columns]

In [17]:
features = all[['has_location',	'match_score']].merge(pd.concat([X_train_enc, X_test_enc]), left_index=True, right_index=True)
features = features.rename(columns={'country': 'encoded_country', 'city': 'encoded_city'})
features.head(50)

    has_location  match_score  encoded_country  encoded_city
id
0              0          NaN         0.421769      0.421769
1              0          NaN         0.422934      0.422934
2              0          NaN         0.421769      0.421769
3              0          NaN         0.421769      0.421769
4              0          NaN         0.420188      0.420188
5              0          NaN         0.420188      0.420188
6              0          NaN         0.420188      0.420188
7              0          NaN         0.414843      0.414843
8              0          NaN         0.422934      0.422934
9              0          NaN         0.421769      0.421769
10             0          NaN         0.422934      0.422934
11             0          NaN         0.421769      0.421769
12             0          NaN         0.421769      0.421769
13             0          NaN         0.424917      0.424917
14             0          NaN         0.420188      0.420188
15             0          NaN         0.420188      0.420188
16             0          NaN         0.422934      0.422934
17             0          NaN         0.422934      0.422934
18             0          NaN         0.414843      0.414843
19             0          NaN         0.425970      0.425970
20             0          NaN         0.414843      0.414843
21             0          NaN         0.421769      0.421769
22             0          NaN         0.421769      0.421769
23             0          NaN         0.414843      0.414843
24             0          NaN         0.425970      0.425970
25             0          NaN         0.424917      0.424917
26             0          NaN         0.425970      0.425970
27             0          NaN         0.421769      0.421769
28             0          NaN         0.425970      0.425970
29             0          NaN         0.421769      0.421769
30             0          NaN         0.421769      0.421769
31             0          NaN         0.422934      0.422934
32             0          NaN         0.420188      0.420188
33             0          NaN         0.420188      0.420188
34             0          NaN         0.414843      0.414843
35             0          NaN         0.421769      0.421769
36             0          NaN         0.422934      0.422934
37             0          NaN         0.414843      0.414843
38             0          NaN         0.425970      0.425970
39             0          NaN         0.420188      0.420188
40             0          NaN         0.425970      0.425970
41             0          NaN         0.425970      0.425970
42             0          NaN         0.421769      0.421769
43             0          NaN         0.421769      0.421769
44             0          NaN         0.420188      0.420188
45             0          NaN         0.421769      0.421769
46             0        100.0         0.368192      0.378641
47             0         68.6         0.500000      0.429660
48             0        100.0         0.374317      0.583333
49             0         73.0         0.372881      0.250000

In [19]:
features.fillna(0).to_csv('../features/features_location.csv', index=True)